#Создайте frozenset из списка [1,2,3,2] и выведите его.
my_list = [1, 2, 3, 2]
print(f"Исходный список: {my_list}")
my_frozenset = frozenset(my_list)
print(f"Полученный frozenset: {my_frozenset}")