#Создайте пустое множество и добавьте в него 5 элементов.
empty_set = set()
print(f"Изначальное пустое множество: {empty_set}")
print(f"Тип объекта: {type(empty_set)}")
print("\nДобавляем 5 элементов:")
empty_set.add(10)
print(f"Добавлен 10: {empty_set}")
empty_set.add("Python")
print(f"Добавлена 'Python': {empty_set}")
empty_set.add(3.14)
print(f"Добавлен 3.14: {empty_set}")
empty_set.add(True)
print(f"Добавлен True: {empty_set}")
empty_set.add(5)
print(f"Добавлен 5: {empty_set}")
print(f"\nИтоговое множество с 5 элементами: {empty_set}")
