#Найдите разность двух множеств {1,2,3,4} и {3,4,5}.
set_a = {1, 2, 3, 4}
set_b = {3, 4, 5}
print(f"Множество A: {set_a}")
print(f"Множество B: {set_b}")
difference_operator = set_a - set_b
print(f"\nРазность множеств (A - B): {difference_operator}")