#Создать lambda-функцию, которая удваивает число.
double_number = lambda x: x * 2
result_int = double_number(5)
print(f"Удвоенное число 5: {result_int}")